{

    "1": "Pause button\n\nThis button pauses the timer. You must have already selected an output file (see 7) and begun recording (see 6) to be able to press the pause button.",
    "2": "Play button\n\nThis button resumes the timer (see 18). You must already be paused (see 1) to be able to press the play button.",
    "3": "Stop button\n\nThis button stops the timer (see 18). Pressing the stop button will also record a new note, timestamped with the timer's current time, indicating that the user has finished entering notes, as well as allow the user to select a different output file (see 7). After you have pressed the stop button, you cannot enter new notes until you have pressed the record button (see 6) again.",
    "4": "Rewind button\n\nThis button rewinds the timer (see 18) the number of seconds specified in the rewind amount field (see 4.1).",
    "4.1": "Rewind amount\n\nThis is where you should enter the number of seconds you would like the timer (see 18) to rewind when you press the rewind button (see 4).",
    "5": "Fast-forward button\n\nThis button fast-forwards the timer (see 18) the number of seconds specified in the fast-forward amount field (see 5.1).",
    "5.1": "Fast-forward amount\n\nThis is where you should enter the number of seconds you would like the timer (see 18) to fast-forward when you press the fast-forward button (see 5).",
    "6": "Record button\n\nThis button starts the timer (see 18). Pressing the record button will also record a new note, timestamped with the current time on the timer (see 18), indicating that the user has begun entering notes. You cannot press the record button until you have selected an output file (see 7).",
    "7": "Output select button\n\nPress this button to open a new file dialog window in which you can select an output file to save your notes to. Output file names normally end in \".txt\". You must have selected an output file to be able to enter notes.",
    "8": "Merge output files button\n\nIf you have multiple output files whose notes you would like to merge and sort based on their timestamps, press this button. You will first be prompted to select the output files whose notes you would like to merge. Then, you will be prompted to select the file you would like to save the merged notes to.",
    "9": "Output path\n\nIf an output file is currently selected, the path to that file will be displayed here. If an output file is not currently selected, a message prompting the user to select an output file will be displayed here. If you have not selected an output file, you cannot write notes. To select an output file, press the output select button (see 7).",
    "10": "Notes log\n\nAll past notes will be displayed here. This area cannot be edited by the user.",
    "11": "Timestamp\n\nThis displays the current timestamp. The value displayed here will be added to the beginning of your next note. To freeze the current timestamp and set it to the current value on the timer (see 18), press the timestamp button (see 11.1). To unfreeze the current timestamp and resynchronize it with the timer, press the clear timestamp button (see 11.2).",
    "11.1": "Timestamp button\n\nPress this button to freeze the timestamp (see 11), setting it to the value currently displayed on the timer (see 18). The timestamp button does NOT stop the timer.",
    "11.2": "Clear timestamp button\n\nPress this button to unfreeze the timestamp (see 11), resynchronizing it with the timer (see 18).",
    "12": "Help button\n\nPress this button for instructions on how to use this program. You have already pressed this button and are currently viewing those instructions.",
    "13": "License button\n\nPress this button to view this program's licensing information. A copy of the entire license can be found here:\nhttps://www.gnu.org/licenses/gpl-3.0.en.html.",
    "14": "Attribution button\n\nPress this button to view attribution for the outside sources that were used to help create this program, which can also be found here:\nhttps://github.com/benfertig/timestamper/blob/main/README.md#attribution",
    "15": "Current note\n\nThis is the area where the user should type their current note. Pressing the \"Cancel note\" button (see 16) will clear this area. Pressing the \"Save note\" button (see 17) will clear this area AND record BOTH the previously entered text AS WELL AS the current timestamp (see 11) in the current output file (see 9) as well as in the notes log (see 10).",
    "16": "Cancel note button\n\nPress this button to clear the \"Current note\" box (see 15) WITHOUT RECORDING THE TIMESTAMP (see 11) OR CURRENT NOTE in the notes log (see 10) or in the current output file (see 9).",
    "17": "Save note button\n\nPress this button to clear the \"Current note\" box (see 15) AND RECORD THE TIMESTAMP (see 11) ALONG WITH THE CURRENT NOTE in the notes log (see 10) and in the current output file (see 9). You must have selected an output file (see 7) to be able to press this button.",
    "18": "Timer\n\nThis area displays the timer's current time. As long as the timer is not running, the user can edit these values. The minimum time supported by the timer is 00h 00m 00.00s. The maximum time supported by the timer is 99h 59m 59.99s."
}
