{
    "1": "Pause button\n\nThis button pauses the timer (see 27). You must have already selected an output file (see 7) and begun recording (see 6) to be able to press the pause button.",
    "2": "Play button\n\nThis button resumes the timer (see 27). You must already be paused (see 1) to be able to press the play button.",
    "3": "Stop button\n\nThis button stops the timer (see 27). Pressing this button will also allow you to select a different output file (see 7) as well as a different audio file (see 10).",
    "4": "Rewind button\n\nThis button rewinds the timer (see 27) the number of seconds specified in the rewind amount field (see 4.1).",
    "4.1": "Rewind amount\n\nThis is where you should enter the number of seconds you would like the timer (see 27) to rewind when you press the rewind button (see 4).",
    "5": "Fast-forward button\n\nThis button fast-forwards the timer (see 27) the number of seconds specified in the fast-forward amount field (see 5.1).",
    "5.1": "Fast-forward amount\n\nThis is where you should enter the number of seconds you would like the timer (see 27) to fast-forward when you press the fast-forward button (see 5).",
    "6": "Record button\n\nThis button starts the timer (see 27). You cannot press the record button until you have selected an output file (see 7).",
    "7": "Output select button\n\nPress this button to open a new file dialog window in which you can select an output file to save your notes to. Output file names normally end in \".txt\". You must have selected an output file to be able to enter notes.",
    "8": "Merge output files button\n\nIf you have multiple output files whose notes you would like to merge and sort based on their timestamps, then you should press this button. You will first be prompted to select the output files whose notes you would like to merge. Then, you will be prompted to select the file that you would like to save those merged notes to. Normally, all files involved in this process should end in \".txt\".",
    "9": "Output path\n\nIf an output file is currently selected, the path to that file will be displayed here. If an output file is not currently selected, a message prompting the user to select an output file will be displayed here. If you have not selected an output file, you cannot write notes. To select an output file, press the output select button (see 7).",
    "10": "Audio select button\n\nOptionally, you can press this button to select an audio file which will be synced with the timer (see 27). This will also enable the use of the audio time slider (see 14) as well as the volume slider (see 16) and mute button (see 17). However, keep in mind that you must have already selected an output file (see 7) to be able to play and manipulate audio.",
    "11": "Audio file path\n\nIf you have selected an audio file (see 10) to sync with the timer (see 27), then the path to that audio file will be displayed here.",
    "12": "Hotkeys\n\nThis section contains three buttons (labeled \"HK1\", \"HK2\" and \"HK3\") which, when pressed, will print a predetermined timestamped note to the notes log (see 15) and the current output file (see 9). The timestamped note that gets printed when each one of these buttons is pressed can be edited in the settings menu (see 13).",
    "13": "Settings button\n\nPressing this button will open the settings menu wherein you can specify, for each individual media button (see 1-6), whether a message should get printed when one is pressed, and if so, what each of those messages should be. In the settings menu, you can also edit the messages that get printed when each hotkey (see 12) is pressed.",
    "14": "Audio time slider\n\nIf an audio file has been selected (see 10), then this slider will allow you to manipulate the time within the audio file at which playback should resume. Timestamps to the left and right of the audio time slider indicate the elapsed and remaining time within the audio file, respectively.",
    "15": "Notes log\n\nAll past notes will be displayed here. This area cannot be edited by the user.",
    "16": "Volume slider\n\nIf an audio file has been selected (see 10), then this slider will allow you to manipulate the volume of the audio. If you have muted the audio (see 17), then moving the audio slider will immediately unmute the audio.",
    "17": "Mute button\n\nIf an audio file has been selected (see 10), then this button will allow you to mute and unmute the audio.",
    "18": "Timestamp\n\nThis displays the current timestamp. The value displayed here will be added to the beginning of your next note. To freeze the current timestamp and set it to the current value on the timer (see 27), press the timestamp button (see 19). To unfreeze the current timestamp and resynchronize it with the timer, press the clear timestamp button (see 20).",
    "19": "Timestamp button\n\nPress this button to freeze the timestamp (see 18), setting it to the value currently displayed on the timer (see 27). The timestamp button does NOT stop the timer.",
    "20": "Clear timestamp button\n\nPress this button to unfreeze the timestamp (see 18), resynchronizing it with the timer (see 27).",
    "21": "Current note\n\nThis is the area where the user should type their current note. Pressing the \"Cancel note\" button (see 25) will clear this area. Pressing the \"Save note\" button (see 26) will clear this area AND record BOTH the previously entered text AS WELL AS the current timestamp (see 18) in the current output file (see 9) as well as in the notes log (see 15).",
    "22": "Help button\n\nPress this button for instructions on how to use this program. You have already pressed this button and are currently viewing those instructions.",
    "23": "License button\n\nPress this button to view this program's licensing information. A copy of the entire license can be found here:\nhttps://www.gnu.org/licenses/gpl-3.0.en.html.",
    "24": "Attribution button\n\nPress this button to view attribution for the outside sources that were used to help create this program, which can also be found here:\nhttps://github.com/benfertig/timestamper/blob/main/README.md#attribution",
    "25": "Cancel note button\n\nPress this button to clear the \"Current note\" box (see 21) WITHOUT RECORDING THE TIMESTAMP (see 18) OR THE CURRENT NOTE to the notes log (see 15) or to the current output file (see 9).",
    "26": "Save note button\n\nPress this button to clear the \"Current note\" box (see 21) AND RECORD THE TIMESTAMP (see 18) ALONG WITH THE CURRENT NOTE to the notes log (see 15) and to the current output file (see 9). You must have already selected an output file (see 7) to be able to press this button.",
    "27": "Timer\n\nThis area displays the timer's current time. As long as the timer is not running, the user can edit these values. The minimum time supported by the timer is 00h 00m 00.00s. The maximum time supported by the timer is 99h 59m 59.99s."
}
